{
    "username": "kojied",
    "posts": [
        {
            "title": "I feel violated by intern season",
            "selftext": "There's this bar that I frequent a few blocks away from my house. Technically different neighborhood, but generally has a mature vibe with people who like music and to dance. Today when I went to the bar and all of a sudden I felt like I was at a college basement party. I thought that I must have been hallucinating, but Then a girl pointed at me and referred to me as the old person. That's when I knew I had to get out of there.\n I was at the wrong party. \n\nAs I walk back home, all of a sudden I realize that there were now tens of thousands of 18 year-old 19 year-old 20-year-olds who were all living on top of each other and were super young and horny to basically use the New York nightlife as their own personal orgy dome.\n Naturally I felt violated\n\nBut then again, I thought to myself. Am I not the same as they are, just at a longer time horizon? I'm also a transient being in the city. They might only be here for three months, but I've only been here for three years as well. As a matter fact, there are bunch of people have done this for generations where their parents and their grandparents and their grandparents all met in New York, and they all decided to live somewhere in the broader region whether it be Westchester, Wilmington, Big Indian, Boston, etc. \nNew York City is equally adventurous to each, so who am I to judge how others enjoy this adventurous city.",
            "subreddit": "newyorkcity",
            "url": "https://reddit.com/r/newyorkcity/comments/1lykkqf/i_feel_violated_by_intern_season/"
        },
        {
            "title": "H1B holders, what are your thoughts on the narrative that you are being exploited?",
            "selftext": "",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1hnx8j0/h1b_holders_what_are_your_thoughts_on_the/"
        },
        {
            "title": "H1B holders, do you feel exploited, or see it as an opportunity to build a better life for you in the US?",
            "selftext": "",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1hnx7lj/h1b_holders_do_you_feel_exploited_or_see_it_as_an/"
        },
        {
            "title": "What needs to happen for the league to review the inconsistencies of the refs?",
            "selftext": "[removed]",
            "subreddit": "nba",
            "url": "https://reddit.com/r/nba/comments/1hcopxo/what_needs_to_happen_for_the_league_to_review_the/"
        },
        {
            "title": "Are you guys for/against banning Tiktok in the US?",
            "selftext": "[removed]",
            "subreddit": "Conservative",
            "url": "https://reddit.com/r/Conservative/comments/1h8ddbp/are_you_guys_foragainst_banning_tiktok_in_the_us/"
        },
        {
            "title": "What’s a movie that best represents your childhood?",
            "selftext": "There's so many coming of age movies for boomers and millennials, what about for gen-Z?",
            "subreddit": "GenZ",
            "url": "https://reddit.com/r/GenZ/comments/1erotgn/whats_a_movie_that_best_represents_your_childhood/"
        },
        {
            "title": "Spacial tours with 3D map and 360˚ video",
            "selftext": "",
            "subreddit": "VisionPro",
            "url": "https://reddit.com/r/VisionPro/comments/1b4yi15/spacial_tours_with_3d_map_and_360_video/"
        },
        {
            "title": "Best blogs, tutorial channels to learn",
            "selftext": "Hey I’m an iOS developer building in visionOS. Do people have recommendations on resources to catch up on new featuresets for spacial computing?",
            "subreddit": "visionosdev",
            "url": "https://reddit.com/r/visionosdev/comments/1b3yugb/best_blogs_tutorial_channels_to_learn/"
        },
        {
            "title": "Can't wait for Vision Air 5 launching in 2034 with these transparent displays!",
            "selftext": "",
            "subreddit": "VisionPro",
            "url": "https://reddit.com/r/VisionPro/comments/1b36n83/cant_wait_for_vision_air_5_launching_in_2034_with/"
        },
        {
            "title": "Watching Edgerunners on the moon feels",
            "selftext": "Thank you u/overpaidengineer for the inspo",
            "subreddit": "VisionPro",
            "url": "https://reddit.com/r/VisionPro/comments/1alx270/watching_edgerunners_on_the_moon_feels/"
        },
        {
            "title": "Killer feature: accessing chatGPT (iPad app) and using audio as primary input",
            "selftext": "I just find this to be much easier than doing it on my Mac + display setup. Give it a try",
            "subreddit": "VisionPro",
            "url": "https://reddit.com/r/VisionPro/comments/1alf7av/killer_feature_accessing_chatgpt_ipad_app_and/"
        },
        {
            "title": "Would you guys like to see Pokemon Go in AVP?",
            "selftext": "Hi guys,\n\nI think Pokemon could be one of the killer use case for the vision pro. Imagine, you could fight players from around the world from the comfort of your couch. With the recent controversy around Palworld, they're looking for the next \"Pokemon Go\" that would propel their franchise to the next level.\n\nBeing Japanese, I happen to know a few key decision makers both in the Pokemon Company as well as Niantic. Alot of the in-game designs are transferrable, and I believe it's a matter of time until Niantic's Lightship ARDK will work on AVP.\n\n*What should I tell them? Lmk if you have thoughts or useful links/videos I should forward to them.*\n\nI'm confident that this will eventually become a thing, but the faster they ship the more AVP adoption we'll see.\n\n[personal info redacted for obvious reasons](https://preview.redd.it/be7qbqfg5qgc1.png?width=800&format=png&auto=webp&s=21fec81575a29fa53fc01639e368980dc4c5ac6f)",
            "subreddit": "VisionPro",
            "url": "https://reddit.com/r/VisionPro/comments/1ajbkqm/would_you_guys_like_to_see_pokemon_go_in_avp/"
        },
        {
            "title": "Can you actually “work” in AVP?",
            "selftext": "I’m curious if people have been able to fully port their workflow into AVP.\n\nI’ve been trying to actually use the Vision Pro to get some work done, but without github and visual studio code, it’s not been the easiest (also obviously no terminal). I could use Mac virtual display, but since I have a M1 MBP the latency is noticeable to the point it’s an adverse experience. I already dropped $4k on this device, renewing my MBP just so I can use it with my AVP is asking a bit too much…\n\nAlso where’s Xcode? If Apple wants AVP to be a “work device”, they gotta have at least Xcode right?\n\nI can get the simple stuff like emails done through AVP, but if this device can’t replace my entire workflow, I don’t know if I can justify the price. I’m sure it’ll get resolved down the line (more of a software issue than hardware constraints), but curious to hear how realistic it is for people to port over their workflow to AVP, and what apps you’d like to see ASAP.",
            "subreddit": "VisionPro",
            "url": "https://reddit.com/r/VisionPro/comments/1aiwqa2/can_you_actually_work_in_avp/"
        },
        {
            "title": "【Theory】 What if we live in the void 800 century",
            "selftext": "Let’s say the WG is the current western civilization. \n\nThe birth of Western history is in the Middle East, specifically Iraq (Nippur). Which is why the west, led by the US, has been trying to cause instability, and destroy historical artifacts. That way, the true history of how the WG came to be won’t come into light. Like, archaeology is basically using artifacts discovered and interpreting it a certain way. The whole concept is something that mostly grew into a concept in the UK around 1824. 1824 is the year the Oxford English Dictionary defined \"archaeology\" a word.\n\n(Btw our generation will be remembered for our new additions which include anti-work, curry laksa, diet-busting, final frontier, fugazi, gajillion, skellington, straight-talking, stonkingly, voguing,etc.)\n\nBack to the main topic, what I’m saying is that it’s pretty easy for the “1%” to control the “story of our world” through archeologists and historians. These have traditionally been an activity for the rich and remains that way. Like, who tries to become a historian unless they have trust funds?\n\nSo yeah, maybe the history we are told on a daily basis is pretty different from reality, and Oda is trying to tell us this message.\n\nWhat are pacifistas? They're our modern comparable to AI. They will be the ultimate, infinite, obedient, power between the celestial dragons (also known as the 1%) and us normal humans.\n\nSo who is our Nika? Who is our Joy Boy? are we too early to hear the drums of liberation, or do we actually all have our own drums of liberation?\n\n&#x200B;\n\n&#x200B;\n\n[tourism of 19th century](https://preview.redd.it/bt1oqgxker7c1.png?width=400&format=png&auto=webp&s=2530f2a3b52b37bfd7547cfe4cf61b5d9d52e7c7)",
            "subreddit": "OnePiece",
            "url": "https://reddit.com/r/OnePiece/comments/18o4k0u/theory_what_if_we_live_in_the_void_800_century/"
        },
        {
            "title": "【Help!】English ivy is withering, any suggestions on what I should do?",
            "selftext": "",
            "subreddit": "plantclinic",
            "url": "https://reddit.com/r/plantclinic/comments/16tj525/helpenglish_ivy_is_withering_any_suggestions_on/"
        },
        {
            "title": "Informative documentary video on YouTube",
            "selftext": "",
            "subreddit": "NYCbike",
            "url": "https://reddit.com/r/NYCbike/comments/16n85uj/informative_documentary_video_on_youtube/"
        },
        {
            "title": "Creepy charlie with dead leaves, is this normal?",
            "selftext": "",
            "subreddit": "plantclinic",
            "url": "https://reddit.com/r/plantclinic/comments/16dlrdq/creepy_charlie_with_dead_leaves_is_this_normal/"
        },
        {
            "title": "Lyft bike on the loose, support team will \"email me as soon as possible\"",
            "selftext": "",
            "subreddit": "Lyft",
            "url": "https://reddit.com/r/Lyft/comments/166ksv7/lyft_bike_on_the_loose_support_team_will_email_me/"
        },
        {
            "title": "Do you guys prefer earphones with cables? Why or why not?",
            "selftext": "Is it the retro look? Is the the convenience of not needing to recharge wireless ones? Is it the price of airpods? Do you care about sound quality?",
            "subreddit": "teenagers",
            "url": "https://reddit.com/r/teenagers/comments/162xom3/do_you_guys_prefer_earphones_with_cables_why_or/"
        },
        {
            "title": "Tracking our individual impacts on the world through ESG ratings",
            "selftext": "&#x200B;\n\n[Mock-up of ESG scores ](https://preview.redd.it/btc0a5nqmhjb1.png?width=632&format=png&auto=webp&s=13920d7c88791b2579b6167e5fe135a136731ef7)\n\n&#x200B;\n\nWe've had ESG ratings for decades now, but it hasn't  played a significant role in the eyes of the consumer. Sure it has developed new investing policies and has made some impact from the shareholder side, but as someone who's worked in environmental consulting, I felt that we needed a more direct way of getting ESG ratings into the mass conscience.\n\n**Do you think individuals should be aware of our own ESG rating?**\n\nI feel that companies would take ESG ratings  seriously if consumers changed their purchase behaviors based on the score.\n\nThe current method of consumer activism has yielded lackluster results. This is because once the news dies down, consumers forget about the scandal and go back to normal purchasing behavior. In addition, companies aren't really incentivized to make changes, since consumers hear about the scandal, but rarely stay informed about what was done about it.\n\nThe first step towards voting with our dollars is to be aware of our current ESG impact. This can be approximated through the ESG score of the companies you are purchasing goods/services from, multiplied by the dollar amount of your purchase. [Sustainalytics](https://www.sustainalytics.com/) has a comprehensive ESG rating for most public companies. For purchases from businesses that are private (and doesn't have any ESG rating), we can approximate from comparable public companies, or use other indicators (BCorp, Fair Trade, etc.)\n\nPlease let me know what you think!\n\nIndividual ESG scores could elevate sustainable conscience to another level, which would lead to climate activism on a larger scale.",
            "subreddit": "ClimateOffensive",
            "url": "https://reddit.com/r/ClimateOffensive/comments/15xgmea/tracking_our_individual_impacts_on_the_world/"
        },
        {
            "title": "How do you decide what to buy and not buy?",
            "selftext": "I've been lurking in this channel for a while now, and have been greatly inspired by the ways people have found ways to stretch their money. This got me thinking, is there a way to develop a mental model on what we buy or don't buy?\n\nI feel that most people decide what to buy based on past experiences, gut feeling, or the mood of that day. But is there a way to better understand what we get our \"gratification\" from, and track this?\n\nMy initial idea was an app that would enable users to track the \"gratification\" they receive from their purchases. If you regret what you bought, you can record a decline in the gratification, or if you found the purchase better than you expected, you can record an increase.\n\nOf course, this would not necessarily apply to all purchases. Some things (rent, insurance, etc.) do not yield any gratification scores, but many purchases (clothes, going out, etc.) could.\n\n&#x200B;\n\nWould love to hear how you make your purchase decisions, and if there's a mental model you follow!\n\n(photo is a mockup of the idea I'm working on)\n\nhttps://preview.redd.it/w7dzy8gi0jib1.png?width=616&format=png&auto=webp&s=803a36d08e4dce445fef0c9b07bbf9a3a1ab97a4",
            "subreddit": "Frugal",
            "url": "https://reddit.com/r/Frugal/comments/15szxcx/how_do_you_decide_what_to_buy_and_not_buy/"
        },
        {
            "title": "English ivy in critical condition",
            "selftext": "I’ve had this baby for two months now, and all of a sudden it started to wither on me. I soaked it in water 3 days ago, but it doesn’t seem to be doing any better…",
            "subreddit": "plantclinic",
            "url": "https://reddit.com/r/plantclinic/comments/15pvycv/english_ivy_in_critical_condition/"
        },
        {
            "title": "3 months in, the cleanest and most functional RV interior zomboid has to offer.",
            "selftext": "",
            "subreddit": "projectzomboid",
            "url": "https://reddit.com/r/projectzomboid/comments/13dwl0i/3_months_in_the_cleanest_and_most_functional_rv/"
        },
        {
            "title": "50k at a time?",
            "selftext": "I want to transfer from Robinhood, but WB only allows 50k transfers at a time. Each transfer which takes 5 days needs to be completed before I can transfer more. \nIs there no way to transfer 50k per day?",
            "subreddit": "Webull",
            "url": "https://reddit.com/r/Webull/comments/flf90r/50k_at_a_time/"
        },
        {
            "title": "Still buying options?",
            "selftext": "I’ve been trading options for the past month or so, and have made good money. But I’ve realized recently that many put options have become quite expensive, to the point that the market has to crash HARD to make great gains. What’s everyone’s move now, since it seems that the looming economic recession is more “priced in” compared to before?",
            "subreddit": "stocks",
            "url": "https://reddit.com/r/stocks/comments/fk6aya/still_buying_options/"
        },
        {
            "title": "Seeking advice: I’ve made some gains buying put options this month, but I’ve not been doing call option spread. Option spread limits risk, but also limits profitability. I know in a normal economic scenario it makes sense, but are spreads still recommended when we can’t see the bottom of the market?",
            "selftext": "",
            "subreddit": "options",
            "url": "https://reddit.com/r/options/comments/fiflte/seeking_advice_ive_made_some_gains_buying_put/"
        },
        {
            "title": "Crazy gains, what now? Should I cash out or double down on puts?",
            "selftext": "",
            "subreddit": "wallstreetbets",
            "url": "https://reddit.com/r/wallstreetbets/comments/fhp5ae/crazy_gains_what_now_should_i_cash_out_or_double/"
        },
        {
            "title": "Why trump probably has coronavirus",
            "selftext": "[removed]",
            "subreddit": "China_Flu",
            "url": "https://reddit.com/r/China_Flu/comments/ffps9r/why_trump_probably_has_coronavirus/"
        },
        {
            "title": "Looking beyond",
            "selftext": "[removed]",
            "subreddit": "wallstreetbets",
            "url": "https://reddit.com/r/wallstreetbets/comments/fddw2r/looking_beyond/"
        },
        {
            "title": "Will Robinhood go down, with our money?",
            "selftext": "[removed]",
            "subreddit": "wallstreetbets",
            "url": "https://reddit.com/r/wallstreetbets/comments/fddvcr/will_robinhood_go_down_with_our_money/"
        },
        {
            "title": "Funeral stocks, yay or nay?",
            "selftext": "Trying to look ahead of the market here. The ZM, APT boat has set sail. What’s next?\n\n[SCI](https://finance.yahoo.com/quote/SCI/)",
            "subreddit": "stocks",
            "url": "https://reddit.com/r/stocks/comments/fawwgp/funeral_stocks_yay_or_nay/"
        }
    ],
    "comments": [
        {
            "body": "Sorry to hear that man, in the future you may want to have multiple granaries, one close to your berries/deer/fish and one for your veggies/apples/honey.\nAlso I just store ale at the tavern or keep it in the brewery for this reason",
            "subreddit": "ManorLords",
            "url": "https://reddit.com/r/ManorLords/comments/1ly3nuf/my_granary_burned_down/n2r16t2/"
        },
        {
            "body": "Yeah but it doesn’t seem to affect much though",
            "subreddit": "ManorLords",
            "url": "https://reddit.com/r/ManorLords/comments/1lwfdh8/anyone_else_having_an_issue_where_their_trading/n2dn0vm/"
        },
        {
            "body": "Incredible stuff! How did you maintain character consistency? Did you generate a consistent character image and then use the image-to-video feature?",
            "subreddit": "ChatGPT",
            "url": "https://reddit.com/r/ChatGPT/comments/1lvtwj3/i_used_ai_to_create_this_short_film_on_human/n2b07h0/"
        },
        {
            "body": "I do too but I rarely finish a game haha. Too little late game content",
            "subreddit": "ManorLords",
            "url": "https://reddit.com/r/ManorLords/comments/1lse9cn/great_game_i_hope_there_is_something_new_added_in/n1i5k2p/"
        },
        {
            "body": "I do too but I rarely finish a game haha. Too little late game content",
            "subreddit": "ManorLords",
            "url": "https://reddit.com/r/ManorLords/comments/1lse9cn/great_game_i_hope_there_is_something_new_added_in/n1i52vu/"
        },
        {
            "body": "You have to kill the bandit units, or donate crop yields though the manor (tithing, different from taxation).",
            "subreddit": "ManorLords",
            "url": "https://reddit.com/r/ManorLords/comments/1lscpmo/how_does_influence_on_hard_work/n1hhd7z/"
        },
        {
            "body": "That proximity is ridiculous, deep mining, two fishing huts, vegetable, orchards, and trade iron for malt.\nimo trading raw materials is easier than trading crafted goods in the current build. High quantity stuff is easy to stock, and you could have multiple trading posts up without any major issues.\nThe exact opposite of this is plate armor. It takes forever to build, requires three points, and needs eight iron slabs to make it. It’s cheaper to just export the ore, and since it’s a low quantity trade, it’s hard to stick multiple trade posts with it",
            "subreddit": "ManorLords",
            "url": "https://reddit.com/r/ManorLords/comments/1lq4lst/this_is_acceptable/n1089i9/"
        },
        {
            "body": "Yeah I was doing alright and then as soon as I upgraded to tier 3 my town was in shambles. I didn’t notice how demanding it was going to be",
            "subreddit": "ManorLords",
            "url": "https://reddit.com/r/ManorLords/comments/1ljgy2w/confession/mzopv8i/"
        },
        {
            "body": "So in general each family will eat each type of food equally. Which means those with low supply are more likely to be consumed first.\n\nEggs I believe each plot only produces one per month, so it's helpful, but won't be sufficient to maintain food diversity",
            "subreddit": "ManorLords",
            "url": "https://reddit.com/r/ManorLords/comments/1lihry5/am_i_doing_something_wrong_with_food_management_i/mzc2uit/"
        },
        {
            "body": "I build my cities close to the borders of others, that way I'm not managing multiple cities at once. The best is building it at the three-way border. That way you're basically managing three cities at once.",
            "subreddit": "ManorLords",
            "url": "https://reddit.com/r/ManorLords/comments/1lg0qii/the_ability_to_combine_regions_or_make_aivassal/myulv47/"
        },
        {
            "body": "Breakfast - Buvette\n\nCoffee - Lyria\n\nLunch - Tsukemen okiboru\n\nCoffee - La cabra\n\nDinner - Isodi\n\nDrinks - Double chicken please",
            "subreddit": "FoodNYC",
            "url": "https://reddit.com/r/FoodNYC/comments/1lc0fio/if_you_had_to_spend_one_full_day_eating_your_way/mxxhvpf/"
        },
        {
            "body": "\\- the hype has definitely faded, you can see that with the price as well as the number of people discussing it on X, or even here  \n\\- haven't seen much innovation in the space at all, the momentum seems to have shifted to solana memecoins, and dissipated after that  \n\\- again, people no longer seem interested. I found linksDAO to be an interesting concept of fractionally owning a golf course, and they're still active but not much hype around them anymore either. Most major brand NFT collaborations have died down as well  \n\\- the NFT craze has not settled into something sustainable, it's dead. Can it come back? Possibly, it has happened before, when cryptopunks and cryptokitties were first hot in 2017-ish, then died, then came back during 2020-2022.  \n\\- will there be a big boom? I personally don't think it would in the way we think of NFTs as collectables. A major thesis was around digital scarcity, and that seemed possible during covid, but post covid people went back to f2f interactions. Digital scarcity could become a hot topic again if we see a broader adoption of VR or even XR, but that seems a bit down the line. I think fractional ownership of assets could be interesting, but they'd just be fungible tokens, not NFT\n\nI see so many one-off posts on this community with only a couple responses. Can't believe there's 2.7M members here. That alone should tell you that NFTs are no longer something people are interested in. I'd love to be proven wrong, since I feel that there was alot of potential, but so far it seems like the community is dead",
            "subreddit": "NFT",
            "url": "https://reddit.com/r/NFT/comments/1l2gcmt/nfts_in_2025_where_are_we_headed/mvt4t5c/"
        },
        {
            "body": "Millenials have less kids, so they have more time and money to spend on themselves. Millenials are also getting married less and later in life, meaning we allocate more effort on self care",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1kz5a0n/do_you_think_millennials_generally_look_younger/mv2xf3q/"
        },
        {
            "body": "I wore a toga. she showed up in regular clothes",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1ksghx5/what_happened_on_the_first_date_that_made_you/mtnzw3v/"
        },
        {
            "body": "Sent dm!",
            "subreddit": "nycrail",
            "url": "https://reddit.com/r/nycrail/comments/1kplupt/anyone_want_this_subway_token_wallet/mt02ziy/"
        },
        {
            "body": "Closest expression is naraku ochi 奈落落ち which means falling from the stage, used in kabuki. It’s a way to say going to hell, but neither the literal translation nor the actual meaning is an expression for child suicide.\nSource: I’m Japanese",
            "subreddit": "OnePiece",
            "url": "https://reddit.com/r/OnePiece/comments/1kpavbs/ive_been_ripping_on_that_part_of_zoros_backstory/mswlma6/"
        },
        {
            "body": "Fyi it says\n“Dear mom, everything I encounter from now is thanks to you”\n(It’s a Mother’s Day special chocolate)",
            "subreddit": "OnePiece",
            "url": "https://reddit.com/r/OnePiece/comments/1kalm70/spotted_at_my_local_heiwado/mpo38g6/"
        },
        {
            "body": "how did you make that diagram? I've been doing it in ascii lol",
            "subreddit": "RooCode",
            "url": "https://reddit.com/r/RooCode/comments/1jwf8oq/heres_how_i_make_use_of_the_different_modes_in/mmih39e/"
        },
        {
            "body": "It’s pretty hard to get consistent characters when they’re photorealistic tbh. I guess our eyes are more lenient when it’s cartoon.\nAny tips for photo realism would be appreciated!",
            "subreddit": "ChatGPT",
            "url": "https://reddit.com/r/ChatGPT/comments/1jpagk5/to_me_the_most_impressive_new_feature_is_the/ml31o85/"
        },
        {
            "body": "Can’t really discuss this without your strategy. If you’re setting up on the coast over river, your strategy must involve maritime trades. Also means you benefit from other cities being on the coast. It also means you need some navy to protect your shipping routes and coastal cities. ",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1jlw2ao/rate_my_starting_locaiton/mk73w0o/"
        },
        {
            "body": "imagine making 60fps videos with photos from OAI images. nothing on the internet can be trusted",
            "subreddit": "ChatGPTJailbreak",
            "url": "https://reddit.com/r/ChatGPTJailbreak/comments/1jliha3/i_cant_believe_i_made_it_do_this_note_i_do_not/mk4no36/"
        },
        {
            "body": "Surprised I don’t see project zomboid. Graphics are retro but the game is so well made. Who knew that you needed a pipe wrench (instead of a regular wrench) to plumb the sink!",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1iz0bzi/which_game_proves_that_graphics_arent_everything/mezpeha/"
        },
        {
            "body": "Daytime bathhouse",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1iypf3t/just_laid_off_what_daytime_nyc_stuff_should_i_do/mexk4g8/"
        },
        {
            "body": "This happens when you are in an advanced technological era than the AI. You can adjust to only give them gold, or other resources which you might not need (e.g. iron/coal).",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1iuhdh9/dude_tf/mdxgebg/"
        },
        {
            "body": "Would you be interested in a trade agreement with England?",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1i6rkdz/gamers_dont_say_the_title_of_the_game_but_what/m8gl211/"
        },
        {
            "body": "Sounds like X",
            "subreddit": "ChatGPT",
            "url": "https://reddit.com/r/ChatGPT/comments/1i2pwva/nuclear_hot_take_on_reddit/m7grdiv/"
        },
        {
            "body": "He used to shoot well and have impact when no one had him on the radar, and opponents didn’t have him on their scouting report.\nNow that there’s pressure to perform, and opponents develop plans on how to deal with him, he’s not doing so well.\n\nReally shows how hard it is to perform when the lights are bright and people are counting on your 3s",
            "subreddit": "warriors",
            "url": "https://reddit.com/r/warriors/comments/1hq7r88/can_someone_explain_why_lindy_is_out_there_over/m4prpxf/"
        },
        {
            "body": "Not in Chelsea but Washington square park has the pigeon whisperer. Bear in mind he’s definitely eccentric and curses a lot so might not be a family friendly guy to talk to.\nAlso the corner of 46th and 6Av always has insane number of pigeons. Like a lot.",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1hpnjqr/ridiculous_question_anybody_know_where_in_chelsea/m4j0ese/"
        },
        {
            "body": "Also left, considering there’ll be an awkward gap between your 3rd city, where AI civs will most likely try to spam settlers into if you’re not careful",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1hp1es7/forward_settle_on_deity/m4dyqsa/"
        },
        {
            "body": "Is this r/2nordic4you",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1hoydmz/if_you_could_be_born_again_which_country_would/m4dcgg6/"
        },
        {
            "body": "Venice and Austria are annoying since they buy city states, skewing with the world congress votes. Also Venice spams missionaries like crazy ",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1hhujby/ranking_the_ai_by_how_dangerous_they_are_on_high/m4dc5oo/"
        },
        {
            "body": "It’s a hard balance to strike, since without growth tiles you can’t reach a pop to build Petra before the AI does, but growth tiles (exception of oasis) aren’t buffed by Petra",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1hoywu7/my_first_game_with_ige_mod_usage_and_an_ideal/m4dbpn9/"
        },
        {
            "body": "Calm down he’s talking about the cloud making the shower",
            "subreddit": "OnePiece",
            "url": "https://reddit.com/r/OnePiece/comments/1hoop3e/what_did_chopper_say/m4b9nvl/"
        },
        {
            "body": "Ok 5 more min with a 5pt deficit. I’m ready to be disappointed again",
            "subreddit": "warriors",
            "url": "https://reddit.com/r/warriors/comments/1hojayb/game_thread_202425_nba_regular_season_golden/m4av54h/"
        },
        {
            "body": "The most unrealistic part is that 18k will get you a cafe in Paris 🇫🇷 ",
            "subreddit": "aivideo",
            "url": "https://reddit.com/r/aivideo/comments/1fidnz4/the_most_emotional_ai_film_youve_seen_yet_4/m4aby21/"
        },
        {
            "body": "Astute observation",
            "subreddit": "OnePiece",
            "url": "https://reddit.com/r/OnePiece/comments/1hok31s/bandage_bandage_no_mi/m4a6r4s/"
        },
        {
            "body": "Little do they know many “top American colleges” have a ton of international students on an F1 visa, which leads to STEM OPT and (hopefully) to an H1B visa. ",
            "subreddit": "LeopardsAteMyFace",
            "url": "https://reddit.com/r/LeopardsAteMyFace/comments/1hohsjk/rconservative_is_in_fullon_meltdown_right_now_its/m49vhkh/"
        },
        {
            "body": "<Spoiler>\n\n\n\n\n\n\n\nAlso we now know that’s current Bonny",
            "subreddit": "OnePiece",
            "url": "https://reddit.com/r/OnePiece/comments/1ho4rnp/one_piece_characters_child_version/m49mtej/"
        },
        {
            "body": "Chopper literally a 🦌 ",
            "subreddit": "OnePiece",
            "url": "https://reddit.com/r/OnePiece/comments/1ho4rnp/one_piece_characters_child_version/m49mpg3/"
        },
        {
            "body": "I’m not going to be disappointed anymore. I know how the warriors give us slight hope just to disappoint",
            "subreddit": "warriors",
            "url": "https://reddit.com/r/warriors/comments/1hnvrmw/game_thread_202425_nba_regular_season_golden/m45hfw5/"
        },
        {
            "body": "Didn’t doubt warriors would lose this one",
            "subreddit": "warriors",
            "url": "https://reddit.com/r/warriors/comments/1hnvrmw/game_thread_202425_nba_regular_season_golden/m45hcfu/"
        },
        {
            "body": "Am I watching basketball with ads or ads with some basketball sprinkled in between",
            "subreddit": "warriors",
            "url": "https://reddit.com/r/warriors/comments/1hnckfr/daily_discussion_thread_december_27_2024/m45d3eq/"
        },
        {
            "body": "I used to be one, and I’m grateful for the opportunity to find a better life here in the US",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1hnx8j0/h1b_holders_what_are_your_thoughts_on_the/m4560kx/"
        },
        {
            "body": "I’m hoping people realize after this that it’s not a left or right issue, but rather those with wealth pitting those less fortunate against each other. \nHopefully we can realize this before it’s too late and develop meaningful solutions",
            "subreddit": "OptimistsUnite",
            "url": "https://reddit.com/r/OptimistsUnite/comments/1hnvi2y/i_made_a_post_a_month_or_so_back_that_maga_will/m454yr1/"
        },
        {
            "body": "I’m definitely done after curry. It was awesome seeing an underdog like him demolish taller players, revolutionize the game with his 3pt shooting.\nWemby is an alien, but I can’t cheer for him the way I could for curry since it’s almost a given that tall players have an advantage (although 7ft+ players have their own longevity challenges). \nOh and the proliferation of gambling definitely doesn’t help either. As a matter of fact, there’s way too many ad breaks. \n\nCut the number of ads in half, make consistent ref calls, and get gambling out of the league. But we know none of those are happening, so I’m definitely out.",
            "subreddit": "warriors",
            "url": "https://reddit.com/r/warriors/comments/1hnrjru/future_of_the_league/m454lgx/"
        },
        {
            "body": "Cloisters, Noguchi museum, more art galleries",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1hntgrp/what_is_your_nyc_to_do_list_for_2025/m453mqo/"
        },
        {
            "body": "You can ask it to alter its speed and complexity of the response if you ask it to. It'll update its memory accordingly as well.   \nThe problem I'm encountering is that it just stops responding after 5 back-and-fourth. Restarting it doesn't help either. I agree the quality has degraded since they came out with the new price tier",
            "subreddit": "ChatGPT",
            "url": "https://reddit.com/r/ChatGPT/comments/1hh2q9r/voice_mode_has_been_brutally_nerfed/m2nxxav/"
        },
        {
            "body": "Whole foods",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1hh2tw3/obvious_signs_that_the_rich_has_come_to_take_ur/m2nvkr5/"
        },
        {
            "body": "They're in the middle so they can see the door closing, making sure no one gets stuck. Other trains probably have sensors in the doors so they know when someone's being squashed",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1hcsb8n/what_do_the_conductors_in_the_middle_subway_cars/m1qihqd/"
        },
        {
            "body": "I’m down to help! Do it at wsp and put up fliers around the city. \nLike the Timothée Chalamet lookalike contest",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1haran2/if_i_created_a_memorial_for_all_those_denied/m1ax9to/"
        },
        {
            "body": "Apparantly you’re the top 1% here on reddit lolol",
            "subreddit": "warriors",
            "url": "https://reddit.com/r/warriors/comments/1h9zxoq/wife_got_courtside_box_seats_from_her_company_and/m15gny0/"
        },
        {
            "body": "Our GCP Credits hard at work haha",
            "subreddit": "warriors",
            "url": "https://reddit.com/r/warriors/comments/1h9zxoq/wife_got_courtside_box_seats_from_her_company_and/m14y4pr/"
        },
        {
            "body": "Having your health insurance claim denied. \nYou think you’re covered because you’ve paid diligently every month, but then an accident happens, and you’re thrown into an endless cycle of calls, being passed around from one representative to another, trying to make sense of it all.",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1h9x0az/deleted_by_user/m14jlnj/"
        },
        {
            "body": "Apparantly wallframes are better because they don’t break",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1h8yia2/the_zombie_apocalypse_has_begun_whats_the_first/m1032p9/"
        },
        {
            "body": "No Home Depots in KY",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1h8yia2/the_zombie_apocalypse_has_begun_whats_the_first/m0xvmnh/"
        },
        {
            "body": "Go to the fire station and stock up on axes. Then go to the hardware store and get a sledgehammer. Destroy the staircase to the second floor of the fire station so zombies can’t get to it.\nStop by the bookstore and VHS store to get The generator magazine and skill tapes, then head to the gun store. \nIf you have the burgler trait Hotwire vehicles, and then secure some food and water.\n\nIykyk",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1h8yia2/the_zombie_apocalypse_has_begun_whats_the_first/m0wmp5q/"
        },
        {
            "body": "The drain is not swamping",
            "subreddit": "LeopardsAteMyFace",
            "url": "https://reddit.com/r/LeopardsAteMyFace/comments/1h8cmh8/trump_appointing_billionaires_oh_no_anyways/m0s5zos/"
        },
        {
            "body": "Oh interesting, I've been going about once a month recently but haven't noticed. I'm going on Sunday again so will let you know what I think",
            "subreddit": "FoodNYC",
            "url": "https://reddit.com/r/FoodNYC/comments/1h87emd/did_rakus_noodle_recipe_change/m0rzprt/"
        },
        {
            "body": "That’s a good suggestion. I’ve found the level below to be too easy doing the optimal route, so will try that",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1h7bmv3/flight_deity/m0lub7c/"
        },
        {
            "body": "The optimal strategy I've discovered is the following\n\n1. rush artist/writer slots and fill them\n2. rush renaissance era via acoustics\n3. bulb writer to fill rationalism slots\n4. if AI wants to be friends, accept (unless negative impact with neighboring civs) and do research agreement\n5. internal food routes (usually to city with artist slots)\n6. pay neighbors to fight eachother (so you don't get attacked)\n7. rush and work science buildings\n8. 7 turns (10 if standard speed) after building and rushing research lab (and working the slot), bulb science, beeline for stealth bombers. (if you have a religion use faith to buy 3-4 scientists)\n9. if you have the capacity, build out military buildings (up to military academy) so you have air repair\n10. go dominate or yeet off to space\n\nI'm usually ahead of AI by the time I build research labs (although they may have more total techs since they fill the science tree more balanced), and left them in the dust when I bulb\n\nIt does get a bit boring after a while though, so I'm trying to find ways to diversify the gameplay.",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1h7bmv3/flight_deity/m0jx8h5/"
        },
        {
            "body": "Hermit with internal trade routes, max rationalism, work every specialist slot, bulb scientists, yeet off to space.",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1h61fr0/on_a_post_about_trade_tariffs/m0a6ok5/"
        },
        {
            "body": "Don’t walk slow. If you’re going to admire the view do it out of the way of pedestrians",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1h2aw9v/whats_one_thing_you_would_tell_a_tourist_to_never/lzi30jy/"
        },
        {
            "body": "Whole pie is always better than a slice. You can get a good sit down pie between two people, or to take home. \n\nWhole pie: John’s on Bleecker (usually 30 min wait)  \n\n Slice: Lucia Pizza of SoHo (Caramelle Piccanti)",
            "subreddit": "FoodNYC",
            "url": "https://reddit.com/r/FoodNYC/comments/1h1zo4k/best_place_to_try_ny_pizza_for_a_first_timer/lzfhgsj/"
        },
        {
            "body": "I’ve noticed this sub is pro-West leaning. If you want a pro-China leaning response you should check out r/sino.\nWe all have our biases. Personally I enjoy lurking in both since the answer is somewhere in between.",
            "subreddit": "China",
            "url": "https://reddit.com/r/China/comments/1h1smq1/whats_the_best_way_as_a_tourist_to_see_the/lze3b0d/"
        },
        {
            "body": "The Coach USA bus takes you to Penn station, Bryant Park, or Grand central. If there's 4 of you I'd suggest an uber though, since the price point isn't that different.  \nIf you still want to take the bus, download the Coach USA, and buy the tickets in advance. Or pay by cash at the bus stop. It's a bit hard to find though, so might want to ask around as well.",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1gzmo85/newark_airport_to_midtown/lyyqsop/"
        },
        {
            "body": "Bold of you to assume I’m out of my bed",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1gyerwn/what_gets_you_out_of_bed_in_the_morning/lyr8hvi/"
        },
        {
            "body": "My personal experience has definitely gotten worse.\nFlight delays are expected at this point, fleets are older with louder engines and narrower cabins, and overall service quality seems to have degraded",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1gx5sln/has_air_travel_gotten_worse/lyei609/"
        },
        {
            "body": "I’m not using it as frequently as I had wished. The battery life is too low to use while flying (even with the extra battery bank it won’t last a full cross country flight)\n\nI’ve not used it at work yet since it’s socially awkward, and people see it weird. \nI’ll use it at wfh now that they have widescreen but 1-2hrs is the max I can do before I need a break\n\nBut holy shit. When I enter immersive videos on appleTV I love it. It’s the coolest thing in the world.",
            "subreddit": "VisionPro",
            "url": "https://reddit.com/r/VisionPro/comments/1gw2bof/should_i_get_one/ly658s7/"
        },
        {
            "body": "You should spam cheap units like scouts into their territory so their units are forced into moving west",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1gvke1r/why_does_budapest_refuse_to_attack_assur/ly3ovey/"
        },
        {
            "body": "The problem is that tithe is so op, and for some reason AI never pick it. I’ve never done your strat so will give it a try though",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1gumxga/what_adjustments_have_you_made_after_at_least_a/lxvjw46/"
        },
        {
            "body": "Dating apps have been normalized but I still would prefer irl encounters compared to apps. Apps also make you see dates as trivial, since there’s always another girl one tap away.\nI usually take the time to leave quality comments, and around 1/3 of them materialize into matches. Some will just like without responding, but I feel like more often than not they do respond.\nIt might also be the type of people I’m attracted to though. I’ve noticed those in their early 20s aren’t really good at conversations, or get more matches so they don’t care as much.\n\nIs there a certain demographic you tend to match with? (Race, age, career)",
            "subreddit": "seduction",
            "url": "https://reddit.com/r/seduction/comments/1gtot3j/hinge_dating_app_review_and_perspective/lxopx3y/"
        },
        {
            "body": "In person 100% You never know if it fits you unless you see it irl. The lines can get long, but it’s often worth it. I got three pairs of shoes and a shirt at the rag&bone one the other day for $130, original price would’ve been $1000\n\nTry to go on the first day if you can, since they do sell out quickly. Be ready to wait an hour or two. \n\nAlso if you have a female friend who’s got good taste in clothes, just ask her what you think would look good in. Ask her if she’s down to go shopping with you.  ",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1gshr7i/fashionable_ppl_of_nyc_where_do_you_shop_for_mens/lxifvet/"
        },
        {
            "body": "At that height you should check out 260 sample sale for your favorite brands. They have good brands that do sales on samples throughout the year. A lot of the sizes left over are XS or XL, so it’d fit you well.\n\nIn terms of brands, here’s some of my favorites\n- APC\n- Acne studios\n- Rag&Bone\n- Maison kitsune\n\nYou should also check out second street for second hand clothing. They’ve got some good hauls there",
            "subreddit": "AskNYC",
            "url": "https://reddit.com/r/AskNYC/comments/1gshr7i/fashionable_ppl_of_nyc_where_do_you_shop_for_mens/lxfmito/"
        },
        {
            "body": "The crazy part is that they still couldn’t get a stop on this play!",
            "subreddit": "warriors",
            "url": "https://reddit.com/r/warriors/comments/1gr4uix/the_shining_triplets_defense/lx3tz1r/"
        },
        {
            "body": "or get lens covers",
            "subreddit": "QuestPro",
            "url": "https://reddit.com/r/QuestPro/comments/1gp0se2/should_i_be_concerned_about_this/lwmnr1k/"
        },
        {
            "body": "Made in Abyss and Akihito Tsukushi. Some say it’s peak anime",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1god9lw/whats_the_most_egregious_example_of_the_writers/lwi7ldf/"
        },
        {
            "body": "Literally me. Diety Persia Petra with Chechen Itza",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1gk8ez5/election_date_in_the_us_means_time_to_reinstall/lvouujm/"
        },
        {
            "body": "First of all you look good! But if you want to become more \"conventionally attractive\", here are some of my suggestions. Just personal opinions, take them or leave them.\n\n  \n**Do away with glasses -** \n\nHave you considered contacts? If not you should look into it. Or lasik although that's a bit pricy (and scary to some). I did it and was the best decision ever.\n\n  \n**Work out -** \n\nmake sure to get enough protein and look into creatine as well\n\nI'd recommend losing weight though cardio & eating healthier, as well as build muscle though bench and squats. Don't forget to stretch too since you can injure yourself! And get a gym rat to spot you. Once you start losing weight you'll see your face slim down as well\n\n[https://www.amazon.com/gp/product/B0BQ3QVQJ9/ref=ppx\\_yo\\_dt\\_b\\_search\\_asin\\_title?ie=UTF8&psc=1](https://www.amazon.com/gp/product/B0BQ3QVQJ9/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1)\n\n[https://www.amazon.com/gp/product/B00ULZF5HC/ref=ppx\\_yo\\_dt\\_b\\_search\\_asin\\_title?ie=UTF8&psc=1](https://www.amazon.com/gp/product/B00ULZF5HC/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1)\n\n  \n**Fashion -** \n\nUniqlo is a good start, but you gotta dress well in Uniqlo\n\n[https://www.instagram.com/steelojeem/reel/C\\_oENHCPkft](https://www.instagram.com/steelojeem/reel/C_oENHCPkft)\n\n(If you're in Japan just buy them there it's cheaper haha)\n\nI wouldn't recommend you wearing anime related items if you're trying to be \"conventionally attractive\". Make it something very subtle, like a tiny totoro tattoo on your wrist, or a ring which doesn't shout ANIMEEEEE! Also if someone asks your about it you can elaborate on your interest, but keep it short and succinct so you don't nerd out until you know they are interested in learning more.\n\nIf you can afford it, go one layer above and try Cos\n\n[https://www.cos.com/en\\_usd/men.html](https://www.cos.com/en_usd/men.html)\n\n\n\n**Eyebrows** **-** \n\nGo get your brows done at an Indian threading place. Take a picture of it, and try to recreate it via shaver below\n\n[https://www.amazon.com/gp/product/B079M8D8Y9/ref=ppx\\_yo\\_dt\\_b\\_search\\_asin\\_title?ie=UTF8&psc=1](https://www.amazon.com/gp/product/B079M8D8Y9/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1)\n\n  \n**Skincare -** \n\nYou seem to be on the oily side like me. Wash your face daily, and use a decent face cream and serum. Here's the ones I use.\n\n[https://www.amazon.com/gp/product/B01N7T7JKJ/ref=ppx\\_yo\\_dt\\_b\\_search\\_asin\\_title?ie=UTF8&psc=1](https://www.amazon.com/gp/product/B01N7T7JKJ/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1)\n\n[https://www.amazon.com/gp/product/B09TV52V57/ref=ewc\\_pr\\_img\\_1?smid=AH5UK1NMFV20Y&psc=1](https://www.amazon.com/gp/product/B09TV52V57/ref=ewc_pr_img_1?smid=AH5UK1NMFV20Y&psc=1)\n\n[https://www.amazon.com/gp/product/B0BL2BB4GV/ref=ewc\\_pr\\_img\\_3?smid=A25W1DZX5FW5M7&psc=1](https://www.amazon.com/gp/product/B0BL2BB4GV/ref=ewc_pr_img_3?smid=A25W1DZX5FW5M7&psc=1)\n\n  \n**Hair** \\- \n\nHonestly I don't know. You could grow it out, shave it, or keep as is. If you're going to shave it keep the beard because you gotta keep one of them. If you're worried about balding there's these crazy services in Turkey where they will regrow your hair (example below). My colleague did it and he looked messed up for a month but now looks amazing (not at this particular spot).\n\n[https://cosmedica.com/](https://cosmedica.com/)\n\n  \nLast but not least, get yourself out there! Getting experience with women/men whoever you are attracted to, is the best way to build confidence. Make mistakes, learn, and grow as a person.\n\nWishing the best for you!",
            "subreddit": "GenZ",
            "url": "https://reddit.com/r/GenZ/comments/1gc4gbc/i_want_to_be_more_conventionally_attractive_you/ltr38yh/"
        },
        {
            "body": "I think you should just shave it off entirely. Get this shaver, it's a bit pricy but you'll never have to worry about shaving again (until you get a blade replacement in a few years)  \n[https://www.amazon.com/dp/B07W5SV5P8?psc=1&ref=ppx\\_yo2ov\\_dt\\_b\\_product\\_details](https://www.amazon.com/dp/B07W5SV5P8?psc=1&ref=ppx_yo2ov_dt_b_product_details)",
            "subreddit": "GenZ",
            "url": "https://reddit.com/r/GenZ/comments/1gc4gbc/i_want_to_be_more_conventionally_attractive_you/ltqzj9f/"
        },
        {
            "body": "Shhhh",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1g8uq20/whats_an_app_thats_actually_worth_paying_for/lt30agt/"
        },
        {
            "body": "fyi aircrafts don't get this benefit, so building a city next to it won't be worth it",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1g130ld/i_played_for_so_many_years_i_have_never_ran_into/lrf0nnw/"
        },
        {
            "body": "There are some key technologies which can give you significant advantage in the early game, either in military or in science. The ones for military are composite Bowmans, chariots, crossbow etc, but the great library doesn’t really help you obtain these since they’re on the opposite side of the tech tree. As in, if you want to beeline for those it’s faster to research those tech instead of researching and beelining for great library.\n\nI think the great library can be beneficial in getting to theology faster, which will get you to borobudur. That’s game changing if you are pushing for religion (which honestly you should unless there are reasons not to). \n\nThe great scientist points are great to have early on, although you often use them for bulk popping once you have research labs up and running.\n\nI usually play at deity where the AI starts miles ahead in technology so don’t even bother, but if you’re playing king or emperor it should be a decent strat.",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1fw0b0w/is_the_great_library_really_not_worth_it_has_my/lqb18ti/"
        },
        {
            "body": "Is there a mod which automatically does this? Would be very helpful :/",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1fu9cfo/late_game_load_times_are_unbearable_for_everyone/lpyweyu/"
        },
        {
            "body": "Oh not as incredible ",
            "subreddit": "museum",
            "url": "https://reddit.com/r/museum/comments/1ftl9b2/karen_hollingsworth_b1955_unwind/lpujkah/"
        },
        {
            "body": "Keep it going!",
            "subreddit": "VisionPro",
            "url": "https://reddit.com/r/VisionPro/comments/1fts3sz/explore_pov_6_month_milestone_huge_updates/lpuchld/"
        },
        {
            "body": "This is a painting!? from 1955!? Incredible",
            "subreddit": "museum",
            "url": "https://reddit.com/r/museum/comments/1ftl9b2/karen_hollingsworth_b1955_unwind/lpucbzy/"
        },
        {
            "body": "It’s a combination of multiple factors, your military strength, the amount of GPT/luxury you can offer, their military might, the other civ’s might, etc.\nWhat seems to impact it the most is how bloodthirsty the AI is. Shaka will go to war with almost anyone, it’s impossible to get Ghandi to attack, unless he’s got nukes. I feel that it’s balanced considering that the violent civs tend to attack you, and those are the ones you can bribe relatively easily.\nEven if the civs aren’t neighbors, if you can get them to declare war on one another they will most likely not attack you, which is already a win. You have the largest disadvantage at the beginning of the game, so it’s easier to catch up as you invest the resources to non-military infrastructure, while your competitors burn hammers on swords and arrows.",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1fszao0/how_often_can_you_beat_deity/lpqalrm/"
        },
        {
            "body": "It depends on who’s my neighbor, if they’re peaceful it’s not too hard, unless someone runs away on science. Try to pit them against each other by bribing them to go to war with each other, which might be easier if you have warmongering neighbors.",
            "subreddit": "civ5",
            "url": "https://reddit.com/r/civ5/comments/1fszao0/how_often_can_you_beat_deity/lpo4k9e/"
        },
        {
            "body": "No more TP/tissue in your bedroom",
            "subreddit": "AskReddit",
            "url": "https://reddit.com/r/AskReddit/comments/1flpcde/deleted_by_user/lo6qtqw/"
        },
        {
            "body": "Oh I hate it when this happens. I remember they were doing all of 10th avenue or something for 20 blocks and it was horrible!\n\nAt least the outcome was worth it though",
            "subreddit": "NYCbike",
            "url": "https://reddit.com/r/NYCbike/comments/1fg6zch/update_on_the_bedford_ave_bike_lane/ln00ba5/"
        },
        {
            "body": "At this point I've written off all my purchases as a loss. I think I had like 5k in it at some point, but I'm not even sure if I was able to take it out via ECOMI either :/\n\nIt's not just an veve issue, from BitClout to friendtech to Rally to NFTs in general, it's basically gone.\n\nI'm treating it as a every expensive life lesson and will be much more cautious when a new hype begins",
            "subreddit": "NFT",
            "url": "https://reddit.com/r/NFT/comments/1fg5e27/marvel_and_disney_nfts_promising_true_ownership/ln001f2/"
        },
        {
            "body": "I appreciate you guys continuing to build this despite the current situation. Please keep it coming!",
            "subreddit": "VisionPro",
            "url": "https://reddit.com/r/VisionPro/comments/1fg6j3x/this_week_on_explore_pov_4_new_experiences_from/lmzzlrm/"
        },
        {
            "body": "The founders may have had good intentions, but they definitely didn’t deliver on them. As for the brands that veve partnered with, they probably saw it more as a marketing opportunity, and considering how a few people care about NFTs, they see the impact of their apathy as negligible to the overall brand image. \nDisney for instance, have received way more flack about trying to use Disney+ terms and conditions on the victim who died in their theme park. \nThe reality is that mainstream attention has moved away from NFTs (if there ever was any), and so they’ve written it off as one of the many, many things they’d like to sweep under the rug.",
            "subreddit": "NFT",
            "url": "https://reddit.com/r/NFT/comments/1fg5e27/marvel_and_disney_nfts_promising_true_ownership/lmzqdsj/"
        },
        {
            "body": "I actually like having no signal on the trains. It's funny seeing people frantically refreshing their tiktok feed even though they know it's not going to load",
            "subreddit": "nycrail",
            "url": "https://reddit.com/r/nycrail/comments/1f90mo6/new_york_city_subway_s_line_gets_cellphone/lliqnpr/"
        },
        {
            "body": "Had some in my school (masters program). Very positive and fun people to be around. Pretty racially diverse, although one of the parents was always white. \nI really enjoyed one dinner where a Mormon person, an orthodox Jewish person, and a catholic person was at the same table debating religion. \nThey used to be on the dance floor at large school parties (sober), but left as soon as the clock struck ten, which I thought was responsible.",
            "subreddit": "GenZ",
            "url": "https://reddit.com/r/GenZ/comments/1f2ngkc/have_you_ever_met_any_non_missionary_mormons_if/lk7nzon/"
        },
        {
            "body": "Uncle boon's crab fried rice is the best",
            "subreddit": "FoodNYC",
            "url": "https://reddit.com/r/FoodNYC/comments/1bcanxi/your_favorite_walkin_solo_lunch_in_manhattan/lk6wn3u/"
        },
        {
            "body": "Welp one less hallucination they do",
            "subreddit": "ChatGPT",
            "url": "https://reddit.com/r/ChatGPT/comments/1f1rgts/deleted_by_user/lk3t9ry/"
        },
        {
            "body": "Did the URL work? That seems like something AI can never really figure out",
            "subreddit": "ChatGPT",
            "url": "https://reddit.com/r/ChatGPT/comments/1f1rgts/deleted_by_user/lk3evig/"
        },
        {
            "body": "If the 4 poneglyphs show the coordinates, why do you need 4? Wouldn't 2 be sufficient?",
            "subreddit": "OnePiece",
            "url": "https://reddit.com/r/OnePiece/comments/1ewv0dk/deleted_by_user/lj1m249/"
        },
        {
            "body": "I love that considering this was at BM she could've been entirely trolling and you would never know",
            "subreddit": "BurningMan",
            "url": "https://reddit.com/r/BurningMan/comments/1eto5ep/in_order_to_be_more_transparent_we_have_decided/lifmwrz/"
        }
    ]
}